gzehentner/ESP32_Projects/Wasserstand_ESP_V05/src/Wasserstand_V5.cpp
  /*=================================================================*/
  /* IDE OTA */
  ArduinoOTA.setHostname(myhostname); // give a name to your ESP for the Arduino IDE
  ArduinoOTA.begin();                 // OTA Upload via ArduinoIDE https://arduino-esp8266.readthedocs.io/en/latest/ota_updates/readme.html



  
  /*=================================================================*/
  beginCurrentLoopSensor();
  
  Serial.print("is_life_system: ");
  Serial.println(isLiveSystem);
  
  #if MyUSE_ADC == ADS1115_ADC
    /*==================================================================*/
    // Prepare analog output
    //  pinMode(LED_PIN, OUTPUT);

    #if BOARDTYPE == ESP32
    /*==================================================================*/
    // prepare I2C interface
      I2CSensors.begin(I2C_SDA, I2C_SCL, 100000);
    #endif

    /*==================================================================*/
    // prepare analog read from ads1115 via I2C
    // ADS 1115 (0x48 .. 0x4B will be the address)
    #if BOARDTYPE == ESP8266
      Wire.begin(I2C_SDA,I2C_SCL);
    #endif

    // check if ADS is runnint
    #if BOARDTYPE == ESP32
      // for ESP32
      if (!ads.begin(0x48, &I2CSensors))
    #else
      // for ESP 8266
      if (!ads.begin())
    #endif
    {
      Serial.println("Couldn't Find ADS 1115");
      //while  (1) // endless loop is not good, because ESP is not updatable by OTA
        ;
    }
    else
    {
      Serial.println("ADS 1115 Found");
      ads.setGain(GAIN_ONE);
      Serial.print("Gain: ");
      Serial.println(ads.getGain());
    }

    #if BOARDTYPE == ESP32
      // PSRAM available?
      log_d("Total heap: %d", ESP.getHeapSize());
      log_d("Free heap: %d", ESP.getFreeHeap());
      log_d("Total PSRAM: %d", ESP.getPsramSize());
      log_d("Free PSRAM: %d", ESP.getFreePsram());
    #endif
  #endif

  // following code is not yet ready for run so we switch of RD_TEST_FILE
  //#define RD_TEST_FILE
  #ifdef RD_TEST_FILE
    if(!LittleFS.begin()){
    Serial.println("An Error has occurred while mounting LittleFS");
    return;
    }
  
    File file = LittleFS.open("/text.txt", "r");
    if(!file){
      Serial.println("Failed to open file for reading");
      return;
    }
  
  // write data to a file
  appendFile("/text.txt","good night\n");
  listDir("/");

  readFile("/text.txt");

  #endif

}
  /*==================================================================*/
  

/*****************************************************************************************************************
 *****************************************************************************************************************
         M A I N L O O P
 *****************************************************************************************************************
 *****************************************************************************************************************/


void loop(void) {

  // **************************************************************************************************
  // ===============================================================================
  // following actions are triggered every 500 ms
  if (millis() - previousMillis_halfSecondAction > halfSecond)
  {

    /*=================================================================*/
    /*  code for getting time from NTP       */
    getEpochTime(epochTime);
    formatDateAndTime(formattedTime, currentDate,epochTime);
    /* End getting time and date */
    
    previousMillis_halfSecondAction = millis();
  }
  // ===============================================================================
  // **************************************************************************************************
  
  // ============================================================================
  // In simulation mode:
  //       Simulate level and relais outputs
  //
  //  GZE shift to a separat file
  // ============================================================================
  if (debugLevelSwitches != debugLevelSwitches_old) {
    if (debugLevelSwitches == 1) {
      // set default values to last actual values, when debug is switched on 
      Serial.print("val_AHH: "); Serial.println(val_AHH);
      Serial.print("val_AH:  "); Serial.println(val_AH);
      Serial.print("val_AL:  "); Serial.println(val_AL);
      simVal_AHH = val_AHH;
      simVal_AH  = val_AH;
      simVal_AL  = val_AL;
      pinMode(GPin_AHH, OUTPUT);
      pinMode(GPin_AH,  OUTPUT);
      pinMode(GPin_AL,  OUTPUT);
      
      digitalWrite(GPin_AHH, simVal_AHH);
      digitalWrite(GPin_AH , simVal_AH);
      digitalWrite(GPin_AL , simVal_AL);
      Serial.println("debug level enabled");
    } else {
      pinMode(GPin_AHH, INPUT_PULLUP);
      pinMode(GPin_AH,  INPUT_PULLUP);
      pinMode(GPin_AL, INPUT_PULLUP);
      Serial.println("debug level disabled");
    }
  }
  debugLevelSwitches_old = debugLevelSwitches;

  // **************************************************************************************************
  // **************************************************************************************************
  /* WebClient */

  seconds_since_startup = millis() / 1000;
  if (clientIntervall > 0 && (seconds_since_startup - clientPreviousSs) >= clientIntervall)
  {
    sendPost();
    clientPreviousSs = seconds_since_startup;
  }
  server.handleClient();

  // **************************************************************************************************
  // **************************************************************************************************

  /* Over the Air UPdate */
  ArduinoOTA.handle(); // OTA Upload via ArduinoIDE

  // **************************************************************************************************
  // **************************************************************************************************
  /* evaluate water level */
  // **************************************************************************************************

  Current2Waterlevel();
 
  SetAlarmState_from_relais();
  SetAlarmState_from_level();
  calculateWorstCaseAlarmState();

